//_ ОПЕРАТОРЫ
//~ арифметические
// + - сложение
// - - вычетание
// * - умножение
// / - деление
// % - остаток от деления, может возвращать отрицательное значение

// складывание строк
st1 := "string1"
st2 := "string2"
st := st1 + " " + st2

//~ сравнения
// == - возвращает true, если операнды равны.
// != - возвращает true, если операнды не равны.
// <  - возвращает true, если первый операнд меньше второго операнда.
// >  - возвращает true, если первый операнд больше второго ранда.
// <= - возвращает true, если первый операнд меньше или равен второму операнду.
// >= - возвращает true, если первый операнд больше или равен второму операнду.

//~ логические
// || - возвращает true (истину), если любой из операндов true. Если первый операнд true, то второй операнд не будет оцениваться.
// && - возвращает true, если оба операнда true. Если первый операнд false, то второй операнд не будет оцениваться.
// !  - возвращает true, если операнд false, и false, если операнд true.