//>> КЛАВИШИ
// панели
alt + t - терминал
alt + e - фокус explorer
alt + a - тогл боковой панели
alt + p - фокус project manager

// работат с открытыми файлами
ctrl + shift + s - сохранить файл    
ctrl + < - к следующему файлу
ctrl + > - к предидущему файл
ctrl + w - закрыть текущий файл

// перемещения по файлу
ctrl + right - следующее слово вправа 
ctrl + right - следующее слово вправа 
//>> ? ctrl + l -  
//>> ? ctrl + j -  

ctrl + f - в конец строки 
ctrl + s - в начало строки
ctrl + up - кинуть курсор вверх
ctrl + down - кинуть курсор вниз
//>> ? ctrl + i - 
//>> ? ctrl + k - 


ctrl + g - перейти к строке

alt + i - курсор 
alt + k - курсор 
alt + j - курсор 
alt + l - курсор 

// редактирование файла
ctrl + c - копировать
ctrl + v - вставить
ctrl + z - отмена действия
ctrl + shift + z - действие вперед
ctrl + [ - удлит слово влево
ctrl + ] - удалить слово вправо

// выделение
alt + w - выделить слово
alt + right - ввыделить вправо
alt + left - ввыделить влево
//>> ?
//>> ?

alt + shift + f - выделить до конца строки 
alt + shift + s - ввыделить до начала строки
alt + shift + right - выделить по следующее слово вправа 
alt + shift + left - выделить по следующее слово слева
//>> ?
//>> ?

alt + up - переместить строку вверх
alt + duwn - переместить строку вниз
//>> ?
//>> ?

alt + shift + up - выделить кинув курсор до верха
alt + shift + down - выделить кинув курсор до низа


// мултитинейный ввод
ctrl + shift + up - добавить курсор вверх
ctrl + shift + down - добавить курсор вниз
ctrl + u - убрать курсор

// поиск и замена
alt + f - поиск
alt + r - заменить
alt + s - переименовать символ

// информация
F12 - провалиться в доки
? ctrl + i - раскрыть варианты по символам
? ctrl + shift + i - раскрыть окошко сравки

// explorer
C - скопировать
X - вырезать
V - вставить
S - поиск
R - переименовать файд
alt + x - колапснуть все директории
enter - открыть файл
ctrl + n - новый файл
ctrl + d - новая директория

// закрыть редактор
ctrl + q - закрыть редактор

// окна
ctrl + shift + n - новое окно

