//_ МЫШЛЕНИЕ
// Процесс познания начинается с ОЩУЩЕНИЙ - отображений материальных свойств 
// предмета или явления, например твердости, цвета.

// Когда различные ощущения свойств связаны в одном предмете или явлении, 
// в мозгу формируется образ предмета или явления.

// Идентификация этого образа могзом называется ВОСПРИЯТИЕ.

// Процесс сопоставление, сравнение и пререработка ощущений и образов, 
// выделения важного и существенного, определения связей и отношений вещей и явлений
// называется МЫШЛЕНИЕМ.

// Воспринимая правильно предметы и явления, можно правильно определить причины и следствия, 
// определить неявные обстоятельства ОПОСРЕДОВАННО. Например есть дым, 
// значит есть огонь.

// Но это не возможно без ОБОБЩЕНИЯ, мозг присваивает свойства предмета или явления
// всем подобным предметам. Например дым, где бы он не возник, один дым или другой,
// может говорить о том что есть и огонь. И мы можем сказать, где дым там и огонь, 
// не зависимо от ситуации.

// МЫШЛЕНИЕ - есть ОПОСРЕДОВАННОЕ и ОБОБЩЕННОЕ понимание действительности.
// ПО этому мы можем осозновать то что не видно.

//_ ЛОГИЧЕСКИЕ ПРИЕМЫ
//~ СРАВНЕНИЕ
// Превым методом познания является сравнение.
// СРАВНЕНИЕ - логический прием, с помощью которого устанавливаются сходства 
// и различия предметов и явлений.

// Чтобы правильно сравнивать:

// Во первых, обьекты сравнения должны быть связаны. Бесполезно сравнивать ум и яблоко.

// Во вторых, нужно определить основу сравнения. Сравнивать мастера по обьему не правильно, 
// важно добавлять и качество работ.

// В теретих, сравнивать нужно по одному и тому же признаку, в одних и тех же обстоятельствах.
// Сравнивая два сосуда с водой на огне, можно прити к выводу что при нагреве воды идет пар.

// В четвертых, сравнение должно производиться только по важнгым и существенным признакам.
// Сравнивать строй по географическому положению неправильно.

//~ АНАЛИЗ И СИНТЕЗ
стр 16



