//_ ТЕРМИНАЛ
F7 - открыть, закрыть терминал
ctrl + backspace - переход по окнам в горизонтали

// ДЕРЕВО ФАЙЛОВ
_ + o - фокус на дерево файлов и обратно
_ + e - показать скрыть дерево файлов

backspase - подняться на верх
. - сделать папку корневой
z - закрыть все узлы

a - создать
d - удалит
r - переименовать файл

p - вставить из буфера
x - вырезать в буфер
y - копировать в буфер

// РЕДАКТОР
// файлы
[ + b - предидущий файл
] + b - следующий файл
_ + с - закрыть файл
_ + bc - закрыть все файлы
_ + bb + symbol - назначение буквы файлу и переход по букве

// экраны
_ + shift | - разделить экран пополам

// перемещения по файлу
w - следующее словой
b - предидкщее слово
e - конец слова
0 - начало линии
^ - конец линии
~ - сменить кейс
{ - предидущая пустая линия
} - следующая пустая линия
v - выделение по символам
V - выделение по строкам
<line> - переход вниз
<line> G - переход вверх 
// редактирование
u - отменить действие
сtrl+r - повторить действием

// СЕСИИ
_ + Ss - сохранить сессию
_ + Sf - загрузить сессию
_ + Sd - удалить сессию

// ПЛАГИНЫ
_ + pa - обновить lazy и mason
_ + pi - установщик плагинов
_ + pU - обновить плагины
